Arellano1904/Texas-Instruments-TivaC/TM4C123GH6PM_develop/drivers/2.4inchDisplay.c
    // ── Set 8×16 window, fire DMA ─────────────────────────────────────────────
    // Window = exactly the character bounding box.
    // ILI9341 will auto-advance within this window — no address math needed.
    display_set_window(x,y,x + FONT_WIDTH - 1, y + FONT_HEIGHT - 1);

    display_enable();      // CS low
    display_data_mode();   // DC high — pixel stream

    // Kick off DMA: 128 pixels × 16-bit = 256 bytes
    display_snd_dma_buffer(g_ui16CharBuf, FONT_WIDTH * FONT_HEIGHT);

    // Must wait for BOTH DMA done AND shift register empty before
    // the next display_set_window() call. set_window sends SPI commands
    // and if SSI is still shifting pixels you corrupt the pixel stream.
    while (MAP_uDMAChannelSizeGet(UDMA_CH15_SSI3TX | UDMA_PRI_SELECT));
    while (SSIBusy(SSI3_BASE));

    display_disable();     // CS high

}

void display_print_string(uint16_t x, uint16_t y,const char *str,uint16_t fgColor,uint16_t bgColor){
    uint16_t curX = x;
    uint16_t curY = y;

    while (*str != '\0')
    {
        char ch = *str++;

        // ── Newline ───────────────────────────────────────────────────────────
        if (ch == '\n')
        {
            curX  = x;          // Return to left margin (not column 0 — respects x)
            curY += FONT_HEIGHT;     // Drop one text row (16 pixels)
            if (curY + FONT_HEIGHT > ILI9341_HEIGHT) return;   // Off bottom → stop
            continue;
        }

        if (ch == '\r') continue;   // Ignore bare carriage return

        // ── Auto word-wrap ───────────────────────────────────────────────────
        // Don't let a character start where it would run past the right edge
        if (curX + FONT_WIDTH > ILI9341_WIDTH)
        {
            curX  = x;
            curY += FONT_HEIGHT;
            if (curY + FONT_HEIGHT > ILI9341_HEIGHT) return;
        }

        display_draw_char(curX, curY, ch, fgColor, bgColor);
        curX += FONT_WIDTH;    // Advance cursor one glyph width
    }
}

void display_print_int(uint16_t x, uint16_t y,int32_t num,uint16_t color, uint16_t bg){
    char buf[12];   // "-2147483648" + '\0' = 12 bytes
    intToStr(num, buf);
    display_print_string(x,y,buf,color,bg);
}

void display_print_float(uint16_t x, uint16_t y,float num, uint8_t decimals,uint16_t color, uint16_t bg){
    // '-' + up to 10 integer digits + '.' + decimals + '\0'.
    // Clamp decimals so the result always fits the buffer.
    char buf[24];
    if (decimals > 9) decimals = 9;
    floatToStr(num, buf,decimals);
    display_print_string(x,y,buf,color,bg);
}

void display_print_hex(uint16_t x, uint16_t y,uint32_t num, uint8_t digits,uint16_t color, uint16_t bg){
    // "0x" + up to 8 hex digits + '\0' = 11 bytes.
    char buf[11];
    hexToStr(num, buf, digits);
    display_print_string(x,y,buf,color,bg);
}

void display_print_info(void){
    display_fill_screen(BLACK);
    display_print_string(0, 0, "Microcontroller:TM4C123GH6PM", RED, BLACK);
    display_print_string(0, 16, "Display driver:ILI9341-240x320p", RED, BLACK);
    display_print_string(0, 32, "Touch controller:XPT2046", RED, BLACK);
}

// spi3 for display //
void display_spi_config(void){
    // Enable SSI3, PORT_D and PORT_B //
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_SSI3);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_SSI3));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOD));
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOB));

    // Configure GPIO Port D pins 0 and 3 to be used as SSI
    MAP_GPIOPinTypeSSI(GPIO_PORTD_BASE,GPIO_PIN_0 | GPIO_PIN_3);

    // Configure PD0, PD3 for SSI3 (CLK, TX) //
    MAP_GPIOPinConfigure(GPIO_PD0_SSI3CLK);
    MAP_GPIOPinConfigure(GPIO_PD3_SSI3TX);

    // Configure ChipSelect (CS-PD1) and DataComand (DC-PD2) pins  //
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, GPIO_PIN_1 | GPIO_PIN_2);

    // Configure RESET pin (PB5) //
    MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE,  GPIO_PIN_5);

    // Configure the SSI3 as SPI MODE0, 16-bit frames, 30 MHz bit clock //
    MAP_SSIConfigSetExpClk(SSI3_BASE,MAP_SysCtlClockGet(),SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,30000000,16);
    // Enabling the SSI3 module //
    MAP_SSIEnable(SSI3_BASE);
}

void display_spi_data_len(uint32_t len){
    MAP_SSIDisable(SSI3_BASE);
    MAP_SSIConfigSetExpClk(SSI3_BASE, MAP_SysCtlClockGet(), SSI_FRF_MOTO_MODE_0,SSI_MODE_MASTER,30000000, len);
    MAP_SSIEnable(SSI3_BASE);
}

// uDMA //
void display_dma_config(void){
    // Enable uDMA peripheral
    MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    while(!MAP_SysCtlPeripheralReady(SYSCTL_PERIPH_UDMA));

    // Enable uDMA controller
    MAP_uDMAEnable();

    // Set base address of control table
    MAP_uDMAControlBaseSet(uDMAControlTable);

    // Enable uDMA on SSI3 TX
    MAP_SSIDMAEnable(SSI3_BASE, SSI_DMA_TX);

    // Optional but safe
    MAP_uDMAChannelAssign(UDMA_CH15_SSI3TX);

    // Disable channel before configuration
    MAP_uDMAChannelDisable(UDMA_CH15_SSI3TX);

    // Configure channel
    MAP_uDMAChannelControlSet(UDMA_CH15_SSI3TX | UDMA_PRI_SELECT,
        UDMA_SIZE_16 |        // 16-bit data (one RGB565 pixel per item)
        UDMA_SRC_INC_16 |     // walk through the source buffer
        UDMA_DST_INC_NONE |   // SSI3 data register stays put
        UDMA_ARB_8);          // re-arbitrate every 8 items (SSI FIFO depth)

    // Transfers are polled to completion in display_snd_dma_buffer(), so the
    // uDMA completion interrupt is left disabled on purpose (no ISR exists).
}

void display_snd_dma_buffer(uint16_t* buffer, uint32_t bufferLen){
    // CS low to enable the Display and DC high to data mode //
    MAP_GPIOPinWrite(GPIO_PORTD_BASE,GPIO_PIN_1 | GPIO_PIN_2, 0x04);
    // Disable channel before setup
    MAP_uDMAChannelDisable(UDMA_CH15_SSI3TX);

    // Configure transfer
    MAP_uDMAChannelTransferSet(
       UDMA_CH15_SSI3TX | UDMA_PRI_SELECT,
        UDMA_MODE_BASIC,
        buffer,
        (void *)(SSI3_BASE + SSI_O_DR),
        bufferLen
    );

    // Start transfer
    MAP_uDMAChannelEnable(UDMA_CH15_SSI3TX);
    // Wait for completion
    while(MAP_uDMAChannelIsEnabled(UDMA_CH15_SSI3TX));
    // Wait for SSI to finish shifting last word
    while(MAP_SSIBusy(SSI3_BASE));

    // CS high to disabble the display //
    MAP_GPIOPinWrite(GPIO_PORTD_BASE, GPIO_PIN_1, GPIO_PIN_1);
}

// Funciones de apoyo
static void intToStr(int32_t value, char *buf){
    char tmp[12];
    int i = 0, j = 0;

    if (value == 0)
    {
        buf[0] = '0';
        buf[1] = '\0';
        return;
    }

